[
  {
    "id": "mob-001",
    "name": "Loyal Hound Companion",
    "slug": "loyal-hound-companion",
    "type": "mob",
    "description": {
      "short": "Tame an adorable pixel-art dachshund that follows, fetches, and fights alongside you.",
      "long": "Adopt a Loyal Hound Companion by taming a wild dachshund with a bone. The hound follows you across all dimensions, fetches dropped items within a 10-block radius, and assists in combat by biting mobs for light damage. It sits on command, sleeps when you do, and wags its tail during idle animations. A collar dye system lets you choose from 16 colors to match your style."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/loyal-hound-companion-thumb.jpg",
    "gallery": [
      "/images/addons/ender-dragon-companion-gallery-1.png",
      "/images/addons/ender-dragon-companion-gallery-2.png",
      "/images/addons/ender-dragon-companion-gallery-3.png"
    ],
    "tags": ["dog", "hound", "companion", "pet", "tameable", "fetch", "mob"],
    "mcVersion": "1.21+",
    "fileSize": "3.7 MB"
  },
  {
    "id": "mob-002",
    "name": "Warden Guardian",
    "slug": "warden-guardian",
    "type": "mob",
    "description": {
      "short": "Summon a tamed Warden to patrol your base and obliterate hostile mobs on sight.",
      "long": "Craft a sculk totem to bind a Warden to your will as the ultimate base defender. The Warden Guardian patrols a configurable radius around the totem, using its sonic boom attack against any hostile mob that dares approach. Upgrade its armor with reinforced deepslate plating to make it nearly indestructible. Includes custom idle and alert animations."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/warden-guardian-thumb.png",
    "gallery": [
      "/images/addons/warden-guardian-gallery-1.png",
      "/images/addons/warden-guardian-gallery-2.png",
      "/images/addons/warden-guardian-gallery-3.png"
    ],
    "tags": ["warden", "guardian", "base defense", "sculk", "deep dark", "patrol"],
    "mcVersion": "1.20.80+",
    "fileSize": "2.9 MB"
  },
  {
    "id": "mob-003",
    "name": "Golden Butterfly",
    "slug": "golden-butterfly",
    "type": "mob",
    "description": {
      "short": "A passive golden butterfly mob that pollinates flowers and drops golden pollen.",
      "long": "Golden Butterflies spawn naturally in flower-rich biomes like meadows, sunflower plains, and cherry groves. They flutter between flowers, triggering a pollination animation that spreads bone meal to adjacent flower blocks. Killing a butterfly drops 1–2 golden pollen items used to brew a Luck potion variant. They are attracted to yellow flowers specifically and can be bred in captivity using dandelion petals, producing a larva that hatches after 20 minutes."
    },
    "price": 2.49,
    "thumbnail": "/images/addons/golden-butterfly-thumb.jpg",
    "gallery": [
      "/images/addons/phantom-wings-gallery-1.png",
      "/images/addons/phantom-wings-gallery-2.png"
    ],
    "tags": ["butterfly", "mob", "passive", "golden", "pollination", "meadow", "flower"],
    "mcVersion": "1.20+",
    "fileSize": "1.8 MB"
  },
  {
    "id": "mob-004",
    "name": "Blaze Rod Warrior",
    "slug": "blaze-rod-warrior",
    "type": "mob",
    "description": {
      "short": "Recruit an armored Blaze warrior that wields dual blaze rods in melee combat.",
      "long": "Forge a nether star scepter to summon the Blaze Rod Warrior, a heavily armored Blaze variant that fights with dual blaze rod weapons in close quarters. Unlike regular Blazes, this warrior charges into melee range, spinning its rods in devastating combos. It is immune to fire and lava, making it the perfect companion for Nether expeditions and fortress raids."
    },
    "price": 2.49,
    "thumbnail": "/images/addons/blaze-rod-warrior-thumb.png",
    "gallery": [
      "/images/addons/blaze-rod-warrior-gallery-1.png",
      "/images/addons/blaze-rod-warrior-gallery-2.png",
      "/images/addons/blaze-rod-warrior-gallery-3.png"
    ],
    "tags": ["blaze", "warrior", "nether", "melee", "fire", "combat"],
    "mcVersion": "1.21+",
    "fileSize": "2.1 MB"
  },
  {
    "id": "mob-005",
    "name": "Pirate Treasure Chest",
    "slug": "pirate-treasure-chest",
    "type": "block",
    "description": {
      "short": "A decorative pirate treasure chest block overflowing with gold and diamonds.",
      "long": "Place the Pirate Treasure Chest as a lavish display block for your storage rooms or adventure map rewards. The chest model is open-lidded and filled with a static pile of gold ingots, diamonds, and emeralds rendered in vanilla pixel art. It functions as a standard large chest for storage while displaying the overflowing treasure visual. Spawns naturally in buried treasure structures when the addon is active, replacing vanilla buried treasure chests."
    },
    "price": 7.99,
    "thumbnail": "/images/addons/pirate-treasure-chest-thumb.jpg",
    "gallery": [
      "/images/addons/drowned-captain-gallery-1.png",
      "/images/addons/drowned-captain-gallery-2.png",
      "/images/addons/drowned-captain-gallery-3.png"
    ],
    "tags": ["treasure", "chest", "pirate", "gold", "diamonds", "decoration", "block", "storage"],
    "mcVersion": "1.20+",
    "fileSize": "4.2 MB"
  },
  {
    "id": "mob-006",
    "name": "Wither Skeleton Knight",
    "slug": "wither-skeleton-knight",
    "type": "mob",
    "description": {
      "short": "An elite Wither Skeleton with full netherite armor, a shield, and wither aura attacks.",
      "long": "The Wither Skeleton Knight is a formidable Nether fortress guardian clad in custom netherite plate armor and wielding a wither-infused greatsword. It blocks incoming attacks with a bone shield and radiates a wither aura that debuffs nearby players. Defeating it drops rare wither bones used to craft the Witherbane sword, a weapon that deals bonus damage to all undead mobs."
    },
    "price": 7.99,
    "thumbnail": "/images/addons/wither-skeleton-knight-thumb.png",
    "gallery": [
      "/images/addons/wither-skeleton-knight-gallery-1.png",
      "/images/addons/wither-skeleton-knight-gallery-2.png"
    ],
    "tags": ["wither skeleton", "knight", "nether", "boss", "armor", "undead", "fortress"],
    "mcVersion": "1.21+",
    "fileSize": "3.4 MB"
  },
  {
    "id": "item-001",
    "name": "Lightning Blade",
    "slug": "lightning-blade",
    "type": "item",
    "description": {
      "short": "A diamond sword crackling with lightning energy that strikes mobs with chain lightning on hit.",
      "long": "Forge the Lightning Blade by combining a diamond sword with a lightning rod at a smithing table during a thunderstorm. Each melee hit triggers a chain lightning discharge that arcs to up to two additional mobs within 5 blocks, dealing 4 bonus lightning damage per arc. The blade is immune to water and deals double damage to mobs that are vulnerable to lightning. A constant crackling particle effect and ambient electricity sound play while the blade is held."
    },
    "price": 2.49,
    "thumbnail": "/images/addons/lightning-blade-thumb.jpg",
    "gallery": [
      "/images/addons/netherite-trident-gallery-1.png",
      "/images/addons/netherite-trident-gallery-2.png"
    ],
    "tags": ["sword", "lightning", "weapon", "diamond", "melee", "chain lightning", "item"],
    "mcVersion": "1.20+",
    "fileSize": "850 KB"
  },
  {
    "id": "item-002",
    "name": "Amethyst Bow",
    "slug": "amethyst-bow",
    "type": "item",
    "description": {
      "short": "A crystalline bow that fires piercing amethyst shards with a satisfying chime.",
      "long": "Craft the Amethyst Bow using amethyst shards and string at a crafting table. This elegant weapon fires custom amethyst shard projectiles that pierce through up to two targets and emit the iconic amethyst chime on impact. Fully charged shots apply a brief slowness effect, making it ideal for crowd control. The bow features a translucent purple crystal model with subtle glow effects."
    },
    "price": 2.49,
    "thumbnail": "/images/addons/amethyst-bow-thumb.png",
    "gallery": [
      "/images/addons/amethyst-bow-gallery-1.png",
      "/images/addons/amethyst-bow-gallery-2.png",
      "/images/addons/amethyst-bow-gallery-3.png"
    ],
    "tags": ["amethyst", "bow", "weapon", "ranged", "crystal", "piercing"],
    "mcVersion": "1.20+",
    "fileSize": "1.2 MB"
  },
  {
    "id": "item-003",
    "name": "Echo Shard Staff",
    "slug": "echo-shard-staff",
    "type": "item",
    "description": {
      "short": "Channel sculk energy through this staff to unleash sonic boom blasts at range.",
      "long": "The Echo Shard Staff is a rare weapon crafted from echo shards and a blaze rod. Right-click to charge and release a directional sonic boom that damages and knocks back all entities in a line. The staff has a cooldown between uses and consumes durability, but can be repaired with echo shards. Its sculk-themed design pulses with teal energy when fully charged."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/echo-shard-staff-thumb.png",
    "gallery": [
      "/images/addons/echo-shard-staff-gallery-1.png",
      "/images/addons/echo-shard-staff-gallery-2.png"
    ],
    "tags": ["echo shard", "staff", "weapon", "sculk", "sonic boom", "magic", "deep dark"],
    "mcVersion": "1.20.80+",
    "fileSize": "1.5 MB"
  },
  {
    "id": "item-004",
    "name": "Sculk Crossbow",
    "slug": "sculk-crossbow",
    "type": "item",
    "description": {
      "short": "A vibration-powered crossbow that locks onto nearby mobs and fires homing bolts.",
      "long": "Infuse a crossbow with sculk catalysts to create the Sculk Crossbow, a weapon that detects vibrations to lock onto targets. When aimed near a mob, the crosshair snaps to the target and fired bolts curve toward them with mild homing capability. Bolts apply darkness for 3 seconds on hit, disorienting enemies. The crossbow features animated sculk veins that spread across its surface."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/sculk-crossbow-thumb.png",
    "gallery": [
      "/images/addons/sculk-crossbow-gallery-1.png",
      "/images/addons/sculk-crossbow-gallery-2.png",
      "/images/addons/sculk-crossbow-gallery-3.png"
    ],
    "tags": ["sculk", "crossbow", "weapon", "homing", "vibration", "darkness", "ranged"],
    "mcVersion": "1.20.80+",
    "fileSize": "1.8 MB"
  },
  {
    "id": "item-005",
    "name": "Voxel Racing Kart",
    "slug": "voxel-racing-kart",
    "type": "item",
    "description": {
      "short": "A driveable red voxel racing kart that reaches high speeds on flat terrain.",
      "long": "Craft the Voxel Racing Kart from red concrete blocks and iron ingots. Right-click to mount and steer with movement keys at speeds up to 24 blocks per second on flat ground. The kart drifts on gravel and sand, slows on soul sand, and reaches top speed on ice. Colliding with a wall or mob deals knockback and ejects the driver. Includes a rev sound effect that scales with speed and a custom red F1-style model."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/voxel-racing-kart-thumb.jpg",
    "gallery": [
      "/images/addons/copper-pickaxe-set-gallery-1.png",
      "/images/addons/copper-pickaxe-set-gallery-2.png",
      "/images/addons/copper-pickaxe-set-gallery-3.png"
    ],
    "tags": ["racing", "kart", "vehicle", "rideable", "speed", "voxel", "item"],
    "mcVersion": "1.21+",
    "fileSize": "2.3 MB"
  },
  {
    "id": "item-006",
    "name": "Pixel Toothbrush",
    "slug": "pixel-toothbrush",
    "type": "item",
    "description": {
      "short": "A decorative pixel-art toothbrush item that grants the Cleansed status effect when used.",
      "long": "Craft the Pixel Toothbrush from blue wool and a stick. Right-clicking grants the Cleansed status effect for 5 minutes, which gradually removes poison, hunger, and weakness debuffs one tier at a time. The toothbrush has 30 uses before it wears out and can be refilled with a water bottle. Its vibrant blue pixel-art design makes it a fun novelty item for survival role-play servers and adventure maps."
    },
    "price": 7.99,
    "thumbnail": "/images/addons/pixel-toothbrush-thumb.jpg",
    "gallery": [
      "/images/addons/ender-pearl-launcher-gallery-1.png",
      "/images/addons/ender-pearl-launcher-gallery-2.png"
    ],
    "tags": ["toothbrush", "item", "status effect", "cleanse", "novelty", "pixel art", "utility"],
    "mcVersion": "1.20+",
    "fileSize": "1.4 MB"
  },
  {
    "id": "block-001",
    "name": "Redstone Building Block",
    "slug": "redstone-building-block",
    "type": "block",
    "description": {
      "short": "A decorative red building block with a classic toy-brick look and Add-on badge texture.",
      "long": "Add a playful toy-brick aesthetic to your builds with the Redstone Building Block. Its bright red surface features raised circular studs and an embossed \"Add-on\" badge on one face, making it a statement piece for creative builds, lobby areas, and showcase rooms. The block comes in a full set of slab, stair, and wall variants and connects flush with other stud-top block variants. It emits a faint redstone glow at night."
    },
    "price": 9.99,
    "thumbnail": "/images/addons/redstone-building-block-thumb.jpg",
    "gallery": [
      "/images/addons/deepslate-dungeon-set-gallery-1.png",
      "/images/addons/deepslate-dungeon-set-gallery-2.png",
      "/images/addons/deepslate-dungeon-set-gallery-3.png"
    ],
    "tags": ["block", "decorative", "building", "redstone", "toy", "brick", "creative"],
    "mcVersion": "1.21+",
    "fileSize": "5.1 MB"
  },
  {
    "id": "block-002",
    "name": "Cherry Blossom Furniture",
    "slug": "cherry-blossom-furniture",
    "type": "block",
    "description": {
      "short": "Elegant cherry wood furniture including tables, chairs, shelves, and lanterns.",
      "long": "Decorate your cherry grove home with this beautiful furniture set crafted from cherry wood planks. Includes dining tables, cushioned chairs, bookshelves, wall lanterns, flower vases, kitchen counters, and a kotatsu-style low table. All pieces feature the signature pink cherry wood aesthetic with subtle petal particle effects. Furniture blocks are interactable where appropriate, with chairs you can sit in and shelves that display items."
    },
    "price": 7.99,
    "thumbnail": "/images/addons/cherry-blossom-furniture-thumb.png",
    "gallery": [
      "/images/addons/cherry-blossom-furniture-gallery-1.png",
      "/images/addons/cherry-blossom-furniture-gallery-2.png",
      "/images/addons/cherry-blossom-furniture-gallery-3.png"
    ],
    "tags": ["cherry blossom", "furniture", "decoration", "building", "interior", "cherry wood"],
    "mcVersion": "1.20+",
    "fileSize": "3.8 MB"
  },
  {
    "id": "block-003",
    "name": "Amethyst Crystal Pack",
    "slug": "amethyst-crystal-pack",
    "type": "block",
    "description": {
      "short": "Decorative amethyst blocks with glowing crystals, chimes, and geode formations.",
      "long": "Expand the amethyst geode aesthetic with 25 new crystal block variants. This pack includes large crystal formations, glowing amethyst lamps, crystal chime wind catchers, polished amethyst slabs and stairs, and hollow geode shell blocks. All blocks emit a soft purple glow and play gentle chime sounds when players walk nearby. Crystal clusters can be oriented in any direction for maximum creative flexibility."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/amethyst-crystal-pack-thumb.png",
    "gallery": [
      "/images/addons/amethyst-crystal-pack-gallery-1.png",
      "/images/addons/amethyst-crystal-pack-gallery-2.png"
    ],
    "tags": ["amethyst", "crystal", "geode", "decoration", "glowing", "blocks", "building"],
    "mcVersion": "1.20+",
    "fileSize": "2.6 MB"
  },
  {
    "id": "block-004",
    "name": "Sculk Sensor Array",
    "slug": "sculk-sensor-array",
    "type": "block",
    "description": {
      "short": "Advanced sculk sensor blocks for building wireless redstone and detection systems.",
      "long": "Take sculk technology to the next level with specialized sensor blocks that filter and relay vibrations with precision. This pack includes directional sensors, frequency filters, signal amplifiers, and sculk relay nodes that transmit redstone signals wirelessly up to 64 blocks. Build sophisticated alarm systems, automatic doors, and hidden mechanisms without a single piece of redstone dust. Includes a guidebook item with circuit diagrams and tutorials."
    },
    "price": 9.99,
    "thumbnail": "/images/addons/sculk-sensor-array-thumb.png",
    "gallery": [
      "/images/addons/sculk-sensor-array-gallery-1.png",
      "/images/addons/sculk-sensor-array-gallery-2.png",
      "/images/addons/sculk-sensor-array-gallery-3.png"
    ],
    "tags": ["sculk", "sensor", "redstone", "wireless", "automation", "technical", "detection"],
    "mcVersion": "1.20.80+",
    "fileSize": "2.2 MB"
  },
  {
    "id": "block-005",
    "name": "Copper Smeltery",
    "slug": "copper-smeltery",
    "type": "block",
    "description": {
      "short": "A copper smeltery block with a glowing furnace core for automated ore processing.",
      "long": "Place the Copper Smeltery to unlock an upgraded furnace tier with a glowing central core. It processes ores twice as fast as a standard furnace and automatically outputs smelted ingots into adjacent chests. The smeltery's amber glow intensifies as its queue grows, giving your base a warm industrial ambiance. Pairs naturally with vanilla copper blocks and oxidizes through the same four patina stages."
    },
    "price": 9.99,
    "thumbnail": "/images/addons/copper-smeltery-thumb.jpg",
    "gallery": [
      "/images/addons/copper-pipe-network-gallery-1.png",
      "/images/addons/copper-pipe-network-gallery-2.png",
      "/images/addons/copper-pipe-network-gallery-3.png"
    ],
    "tags": ["copper", "smeltery", "furnace", "automation", "smelting", "block", "crafting"],
    "mcVersion": "1.21+",
    "fileSize": "3.3 MB"
  },
  {
    "id": "block-006",
    "name": "Mangrove Building Set",
    "slug": "mangrove-building-set",
    "type": "block",
    "description": {
      "short": "Tropical mangrove blocks with stilted foundations, rope bridges, and thatched roofs.",
      "long": "Build stunning tropical villages and swamp outposts with this mangrove-themed construction set. Includes stilted foundation posts, woven rope bridges, thatched roof panels, mangrove root lattice walls, hanging vine curtains, and mud-brick accent blocks. All pieces blend naturally with vanilla mangrove wood and muddy mangrove roots. The set is designed for elevated builds over water, with foundation blocks that snap to varying heights for an organic, uneven look."
    },
    "price": 7.99,
    "thumbnail": "/images/addons/mangrove-building-set-thumb.png",
    "gallery": [
      "/images/addons/mangrove-building-set-gallery-1.png",
      "/images/addons/mangrove-building-set-gallery-2.png",
      "/images/addons/mangrove-building-set-gallery-3.png"
    ],
    "tags": ["mangrove", "building", "tropical", "swamp", "decoration", "blocks", "village"],
    "mcVersion": "1.20+",
    "fileSize": "4.5 MB"
  },
  {
    "id": "system-001",
    "name": "World Settings Manager",
    "slug": "world-settings-manager",
    "type": "system",
    "description": {
      "short": "A comprehensive in-game UI for managing world rules, difficulty, mob spawning, and tick speed without commands.",
      "long": "The World Settings Manager adds a sleek, touch-friendly settings panel accessible from a custom craftable tablet item or the pause menu. Operators and world owners can toggle game rules, adjust difficulty, control mob spawning categories, set random tick speed, manage weather cycles, and configure player permissions — all without typing a single slash command. Changes are logged with timestamps and player names so server admins can audit who changed what. The addon also supports preset profiles that can be saved, loaded, and shared as exportable files, making it easy to switch between survival, creative building, and minigame configurations instantly."
    },
    "price": 4.99,
    "thumbnail": "/images/addons/world-settings-manager-thumb.png",
    "gallery": [
      "/images/addons/world-settings-manager-gallery-1.png",
      "/images/addons/world-settings-manager-gallery-2.png"
    ],
    "tags": ["system", "settings", "management", "game rules", "admin", "server", "configuration"],
    "mcVersion": "1.21+",
    "fileSize": "2.1 MB"
  }
]
